# Rebar Bar Type Get Crank Straight Length Method

Source: https://www.revitapidocs.com/2026/5183a2a1-1861-9473-46ea-b023d9c95525.htm

---

| Rebar Bar Type Get Crank Straight Length Method |
| --- |

Gets the crank straigth length taking into account the specified Rebar Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetCrankStraightLength(
	ElementId rebarCrankTypeId
)
```

```
Public Function GetCrankStraightLength (
	rebarCrankTypeId As ElementId
) As Double
```

```
public:
double GetCrankStraightLength(
	ElementId^ rebarCrankTypeId
)
```

```
member GetCrankStraightLength :
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.
 Interactions with Rebar Crank Types can be done with the functions in \[!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils] .

#### Return Value

Double
Returns the crank straigth length. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace